{
  "caption": "Domains",
  "description": "A comprehensive table outlining distinct fields of application and knowledge areas within the framework.",
  "name": "domain_categories",
  "attributes": {
    "technology": {
      "uid": 1,
      "caption": "Technology",
      "description": "Development, management, and use of systems, devices, and software to solve problems and enhance human capabilities."
    },
    "finance_and_business": {
      "uid": 2,
      "caption": "Finance and Business",
      "description": "Managing money, investments, and financial risks within businesses or for individuals. Subdomains: Corporate Finance, Personal Finance, Risk Management, Accounting, and Financial Analysis."
    },
    "life_science": {
      "uid": 3,
      "caption": "Life Science",
      "description": "Scientific research and innovations in biology, genetics, biotechnology, and other related fields, with the goal of understanding life processes and advancing medical and environmental solutions. Subdomains: Biotechnology, Pharmaceutical Research, Genomics, Bioinformatics, and Molecular Biology."
    },
    "trust_and_safety": {
      "uid": 4,
      "caption": "Trust and Safety",
      "description": "Maintaining a secure and reliable environment, primarily online, by managing risks, preventing harm, and ensuring safety and privacy. Subdomains: Online Safety, Content Moderation, Fraud Prevention, Data Privacy, and Risk Management."
    },
    "human_resources": {
      "uid": 5,
      "caption": "Human Resources",
      "description": "Managing and optimizing the workforce of an organization, focusing on recruitment, employee development, and workplace culture. Subdomains: Recruitment, Employee Relations, Training and Development, Compensation and Benefits, and HR Analytics."
    },
    "education": {
      "uid": 6,
      "caption": "Education",
      "description": "Systems, methods, and technologies used to teach, learn, and foster knowledge development in individuals and communities. Subdomains: E-Learning, Curriculum Design, Learning Management Systems, Educational Technology, and Pedagogy."
    },
    "industrial_manufacturing": {
      "uid": 7,
      "caption": "Industrial Manufacturing",
      "description": "Production of goods, use of automation and technology in manufacturing, and industrial processes to create products on a large scale. Subdomains: Automation, Robotics, Supply Chain Management, Lean Manufacturing, and Process Engineering."
    },
    "transportation": {
      "uid": 8,
      "caption": "Transportation",
      "description": "Systems and processes involved in the movement of goods and people, as well as the physical infrastructure supporting them. Subdomains: Logistics, Automotive, Public Transit, Supply Chain, Freight, and Autonomous Vehicles."
    },
    "healthcare": {
      "uid": 9,
      "caption": "Healthcare",
      "description": "Management, delivery, and innovation of medical services, treatments, and technologies aimed at improving the health and well-being of individuals and populations."
    },
    "legal": {
      "uid": 10,
      "caption": "Legal",
      "description": "Legal systems, compliance, regulatory frameworks, contract management, and judicial processes. Subdomains: Contract Law, Intellectual Property, Regulatory Compliance, Litigation, Legal Research, and Corporate Governance."
    },
    "agriculture": {
      "uid": 11,
      "caption": "Agriculture",
      "description": "Cultivation of plants and livestock, farm management, agtech innovations, and sustainable food production systems. Subdomains: Precision Agriculture, Crop Management, Livestock Management, Agricultural Technology, and Sustainable Farming."
    },
    "energy": {
      "uid": 12,
      "caption": "Energy",
      "description": "Production, distribution, and management of energy resources including renewable energy, power grids, and energy efficiency. Subdomains: Renewable Energy, Oil and Gas, Power Generation, Energy Storage, Smart Grids, and Energy Management."
    },
    "media_and_entertainment": {
      "uid": 13,
      "caption": "Media and Entertainment",
      "description": "Creation, distribution, and consumption of content across various media platforms including broadcasting, streaming, gaming, and publishing. Subdomains: Content Creation, Broadcasting, Streaming Services, Gaming, Publishing, and Digital Media."
    },
    "real_estate": {
      "uid": 14,
      "caption": "Real Estate",
      "description": "Property management, real estate transactions, construction, urban planning, and property technology. Subdomains: Property Management, Real Estate Investment, Construction, Urban Planning, PropTech, and Facilities Management."
    },
    "hospitality_and_tourism": {
      "uid": 15,
      "caption": "Hospitality and Tourism",
      "description": "Services related to travel, accommodation, food service, event management, and tourism operations. Subdomains: Hotel Management, Travel Services, Event Planning, Food and Beverage, Tourism Operations, and Guest Experience."
    },
    "telecommunications": {
      "uid": 16,
      "caption": "Telecommunications",
      "description": "Communication networks, mobile services, internet infrastructure, and connectivity solutions. Subdomains: Mobile Networks, Broadband, Satellite Communications, Network Infrastructure, VoIP, and 5G/6G Technologies."
    },
    "environmental_science": {
      "uid": 17,
      "caption": "Environmental Science",
      "description": "Study and management of environmental systems, climate change, conservation, and sustainability practices. Subdomains: Climate Science, Conservation, Environmental Monitoring, Sustainability, Waste Management, and Pollution Control."
    },
    "government_and_public_sector": {
      "uid": 18,
      "caption": "Government and Public Sector",
      "description": "Public administration, civic services, policy making, and governance systems. Subdomains: Public Administration, Policy Development, Civic Technology, Emergency Services, Urban Services, and Regulatory Agencies."
    },
    "research_and_development": {
      "uid": 19,
      "caption": "Research and Development",
      "description": "Scientific research, innovation, experimental development, and knowledge creation across disciplines. Subdomains: Scientific Research, Innovation Management, Laboratory Operations, Patent Development, Experimental Design, and Research Analytics."
    },
    "retail_and_ecommerce": {
      "uid": 20,
      "caption": "Retail and E-commerce",
      "description": "Sales operations, customer experience, inventory management, and online marketplace platforms. Subdomains: E-commerce Platforms, Retail Operations, Inventory Management, Customer Experience, Payment Systems, and Supply Chain."
    },
    "social_services": {
      "uid": 21,
      "caption": "Social Services",
      "description": "Welfare programs, community support, non-profit operations, and social welfare systems. Subdomains: Community Services, Non-profit Management, Social Welfare, Child Services, Elder Care, and Disability Services."
    },
    "sports_and_fitness": {
      "uid": 22,
      "caption": "Sports and Fitness",
      "description": "Athletic performance, fitness management, sports analytics, and recreational activities. Subdomains: Sports Analytics, Fitness Training, Sports Medicine, Event Management, Recreational Programs, and Performance Tracking."
    },
    "insurance": {
      "uid": 23,
      "caption": "Insurance",
      "description": "Risk assessment, policy management, claims processing, and insurance product development. Subdomains: Underwriting, Claims Management, Risk Assessment, Policy Administration, Actuarial Science, and InsurTech."
    },
    "marketing_and_advertising": {
      "uid": 24,
      "caption": "Marketing and Advertising",
      "description": "Brand management, customer engagement, digital marketing, advertising campaigns, and market research. Subdomains: Digital Marketing, Brand Management, Market Research, Advertising Technology, Content Marketing, and Customer Analytics."
    }
  }
}
